Ran Plan for project: `sharedservices-prod` dir: `accounts/sharedservices-prod` workspace: `default`

<details><summary>Show Output</summary>

```diff
Wrote /home/atlantis/.atlantis/prod-ue2-multiaccounts.tfvars with secrets from SSM.


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place
- destroy

Terraform will perform the following actions:

  # aws_api_gateway_integration.start_execution_integration will be updated in-place
~ resource "aws_api_gateway_integration" "start_execution_integration" {
        id                      = "agi-70paytfqfb-g6k3d8-POST"
      ~ uri                     = "arn:aws:apigateway:us-east-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-2:825765422855:function:api-router/invocations" -> (known after apply)
        # (15 unchanged attributes hidden)
    }

  # aws_cloudwatch_dashboard.lambdas_dashboard will be created
+ resource "aws_cloudwatch_dashboard" "lambdas_dashboard" {
      + dashboard_arn  = (known after apply)
      + dashboard_body = jsonencode(
            {
              + widgets = [
                  + {
                      + height     = 6
                      + properties = {
                          + metrics = [
                              + [
                                  + "AWS/Lambda",
                                  + "Errors",
                                  + "FunctionName",
                                  + "render_video",
                                ],
                              + [
                                  + ".",
                                  + "Errors",
                                  + "FunctionName",
                                  + "notify_post",
                                ],
                            ]
                          + period  = 300
                          + region  = "us-east-2"
                          + stat    = "Sum"
                          + title   = "Lambda Errors"
                        }
                      + type       = "metric"
                      + width      = 12
                      + x          = 0
                      + y          = 0
                    },
                  + {
                      + height     = 6
                      + properties = {
                          + metrics = [
                              + [
                                  + "AWS/Lambda",
                                  + "Throttles",
                                  + "FunctionName",
                                  + "render_video",
                                ],
                              + [
                                  + ".",
                                  + "Throttles",
                                  + "FunctionName",
                                  + "notify_post",
                                ],
                            ]
                          + period  = 300
                          + region  = "us-east-2"
                          + stat    = "Sum"
                          + title   = "Lambda Throttles"
                        }
                      + type       = "metric"
                      + width      = 12
                      + x          = 12
                      + y          = 0
                    },
                ]
            }
        )
      + dashboard_name = "LambdaDashboard"
      + id             = (known after apply)
    }

  # aws_cloudwatch_dashboard.step_functions_dashboard will be created
+ resource "aws_cloudwatch_dashboard" "step_functions_dashboard" {
      + dashboard_arn  = (known after apply)
      + dashboard_body = (known after apply)
      + dashboard_name = "StepFunctionsDashboard"
      + id             = (known after apply)
    }

  # aws_cloudwatch_event_rule.crossaccount_schedule will be destroyed
  # (because aws_cloudwatch_event_rule.crossaccount_schedule is not in configuration)
- resource "aws_cloudwatch_event_rule" "crossaccount_schedule" {
      - arn                 = "arn:aws:events:us-east-2:825765422855:rule/crossaccount-invoker-schedule" -> null
      - event_bus_name      = "default" -> null
      - force_destroy       = false -> null
      - id                  = "crossaccount-invoker-schedule" -> null
      - is_enabled          = true -> null
      - name                = "crossaccount-invoker-schedule" -> null
      - schedule_expression = "rate(1 hour)" -> null
      - state               = "ENABLED" -> null
      - tags                = {} -> null
      - tags_all            = {
          - "DeployedBy"  = "Terraform"
          - "Environment" = "prod"
          - "Project"     = "sharedservices"
        } -> null
        # (3 unchanged attributes hidden)
    }

  # aws_cloudwatch_event_target.crossaccount_target will be destroyed
  # (because aws_cloudwatch_event_target.crossaccount_target is not in configuration)
- resource "aws_cloudwatch_event_target" "crossaccount_target" {
      - arn            = "arn:aws:lambda:us-east-2:825765422855:function:crossaccount_invoker" -> null
      - event_bus_name = "default" -> null
      - force_destroy  = false -> null
      - id             = "crossaccount-invoker-schedule-crossaccount-invoker-target" -> null
      - rule           = "crossaccount-invoker-schedule" -> null
      - target_id      = "crossaccount-invoker-target" -> null
        # (3 unchanged attributes hidden)
    }

  # aws_cloudwatch_log_group.api_router will be destroyed
  # (because aws_cloudwatch_log_group.api_router is not in configuration)
- resource "aws_cloudwatch_log_group" "api_router" {
      - arn               = "arn:aws:logs:us-east-2:825765422855:log-group:/aws/lambda/api_router" -> null
      - id                = "/aws/lambda/api_router" -> null
      - log_group_class   = "STANDARD" -> null
      - name              = "/aws/lambda/api_router" -> null
      - retention_in_days = 3 -> null
      - skip_destroy      = false -> null
      - tags              = {} -> null
      - tags_all          = {
          - "DeployedBy"  = "Terraform"
          - "Environment" = "prod"
          - "Project"     = "sharedservices"
        } -> null
        # (2 unchanged attributes hidden)
    }

  # aws_cloudwatch_log_group.crossaccount_invoker will be destroyed
  # (because aws_cloudwatch_log_group.crossaccount_invoker is not in configuration)
- resource "aws_cloudwatch_log_group" "crossaccount_invoker" {
      - arn               = "arn:aws:logs:us-east-2:825765422855:log-group:/aws/lambda/crossaccount_invoker" -> null
      - id                = "/aws/lambda/crossaccount_invoker" -> null
      - log_group_class   = "STANDARD" -> null
      - name              = "/aws/lambda/crossaccount_invoker" -> null
      - retention_in_days = 3 -> null
      - skip_destroy      = false -> null
      - tags              = {} -> null
      - tags_all          = {
          - "DeployedBy"  = "Terraform"
          - "Environment" = "prod"
          - "Project"     = "sharedservices"
        } -> null
        # (2 unchanged attributes hidden)
    }

  # aws_cloudwatch_log_group.manual_step_function_log_group will be created
+ resource "aws_cloudwatch_log_group" "manual_step_function_log_group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/vendedlogs/states/manual_workfloww"
      + name_prefix       = (known after apply)
      + retention_in_days = 3
      + skip_destroy      = false
      + tags_all          = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "sharedservices"
        }
    }

  # aws_cloudwatch_log_group.notify_post_log_group will be created
+ resource "aws_cloudwatch_log_group" "notify_post_log_group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/notify_post"
      + name_prefix       = (known after apply)
      + retention_in_days = 3
      + skip_destroy      = false
      + tags_all          = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "sharedservices"
        }
    }

  # aws_cloudwatch_log_group.render_video_log_group will be created
+ resource "aws_cloudwatch_log_group" "render_video_log_group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/render_video"
      + name_prefix       = (known after apply)
      + retention_in_days = 3
      + skip_destroy      = false
      + tags_all          = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "sharedservices"
        }
    }

  # aws_cloudwatch_metric_alarm.manual_workflow_failures will be created
+ resource "aws_cloudwatch_metric_alarm" "manual_workflow_failures" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:us-east-2:825765422855:sharedservices-monitoring-topic",
        ]
      + alarm_description                     = "Alert if the manual Step Function fails within a 5-minute window."
      + alarm_name                            = "sharedservices-manual-workflow-failures"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + dimensions                            = (known after apply)
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "ExecutionsFailed"
      + namespace                             = "AWS/States"
      + period                                = 300
      + statistic                             = "Sum"
      + tags_all                              = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "sharedservices"
        }
      + threshold                             = 1
      + treat_missing_data                    = "missing"
    }

  # aws_cloudwatch_metric_alarm.notify_post_invocations_anomaly will be created
+ resource "aws_cloudwatch_metric_alarm" "notify_post_invocations_anomaly" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:us-east-2:825765422855:sharedservices-monitoring-topic",
        ]
      + alarm_description                     = "Alert if notify_post invocations deviate from normal"
      + alarm_name                            = "sharedservices-notify-post-invocations-anomaly"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanUpperThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + tags_all                              = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "sharedservices"
        }
      + threshold_metric_id                   = "e1"
      + treat_missing_data                    = "missing"

      + metric_query {
          + id          = "m1"
          + label       = "NotifyPostInvocationsWithAnomalyDetection"
          + return_data = true
            # (2 unchanged attributes hidden)

          + metric {
              + dimensions  = {
                  + "FunctionName" = "notify_post"
                }
              + metric_name = "Invocations"
              + namespace   = "AWS/Lambda"
              + period      = 300
              + stat        = "Sum"
                # (1 unchanged attribute hidden)
            }
        }
      + metric_query {
          + expression  = "ANOMALY_DETECTION_BAND(m1, 2)"
          + id          = "e1"
          + label       = "AnomalyDetectionBand"
          + return_data = true
            # (1 unchanged attribute hidden)
        }
    }

  # aws_cloudwatch_metric_alarm.render_video_invocations_anomaly will be created
+ resource "aws_cloudwatch_metric_alarm" "render_video_invocations_anomaly" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:us-east-2:825765422855:sharedservices-monitoring-topic",
        ]
      + alarm_description                     = "Alert if render_video invocations deviate from normal"
      + alarm_name                            = "sharedservices-render-video-invocations-anomaly"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanUpperThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + tags_all                              = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "sharedservices"
        }
      + threshold_metric_id                   = "e1"
      + treat_missing_data                    = "missing"

      + metric_query {
          + id          = "m1"
          + label       = "RenderVideoInvocationsWithAnomalyDetection"
          + return_data = true
            # (2 unchanged attributes hidden)

          + metric {
              + dimensions  = {
                  + "FunctionName" = "render_video"
                }
              + metric_name = "Invocations"
              + namespace   = "AWS/Lambda"
              + period      = 300
              + stat        = "Sum"
                # (1 unchanged attribute hidden)
            }
        }
      + metric_query {
          + expression  = "ANOMALY_DETECTION_BAND(m1, 2)"
          + id          = "e1"
          + label       = "AnomalyDetectionBand"
          + return_data = true
            # (1 unchanged attribute hidden)
        }
    }

  # aws_cloudwatch_metric_alarm.sns_to_teams_invocations_anomaly will be created
+ resource "aws_cloudwatch_metric_alarm" "sns_to_teams_invocations_anomaly" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:us-east-2:825765422855:sharedservices-monitoring-topic",
        ]
      + alarm_description                     = "Alert if sns_to_teams invocations deviate from normal"
      + alarm_name                            = "sharedservices-sns-to-teams-invocations-anomaly"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanUpperThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + tags_all                              = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "sharedservices"
        }
      + threshold_metric_id                   = "e1"
      + treat_missing_data                    = "missing"

      + metric_query {
          + id          = "m1"
          + label       = "SnsToTeamsInvocationsWithAnomalyDetection"
          + return_data = true
            # (2 unchanged attributes hidden)

          + metric {
              + dimensions  = {
                  + "FunctionName" = "sharedservices-sns-to-teams"
                }
              + metric_name = "Invocations"
              + namespace   = "AWS/Lambda"
              + period      = 300
              + stat        = "Sum"
                # (1 unchanged attribute hidden)
            }
        }
      + metric_query {
          + expression  = "ANOMALY_DETECTION_BAND(m1, 2)"
          + id          = "e1"
          + label       = "AnomalyDetectionBand"
          + return_data = true
            # (1 unchanged attribute hidden)
        }
    }

  # aws_efs_access_point.lambda_ap will be created
+ resource "aws_efs_access_point" "lambda_ap" {
      + arn             = (known after apply)
      + file_system_arn = (known after apply)
      + file_system_id  = (known after apply)
      + id              = (known after apply)
      + owner_id        = (known after apply)
      + tags_all        = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "sharedservices"
        }

      + posix_user {
          + gid = 1000
          + uid = 1000
        }

      + root_directory {
          + path = "/lambda"

          + creation_info {
              + owner_gid   = 1000
              + owner_uid   = 1000
              + permissions = "755"
            }
        }
    }

  # aws_efs_file_system.lambda_efs will be created
+ resource "aws_efs_file_system" "lambda_efs" {
      + arn                     = (known after apply)
      + availability_zone_id    = (known after apply)
      + availability_zone_name  = (known after apply)
      + creation_token          = "lambda-efs"
      + dns_name                = (known after apply)
      + encrypted               = true
      + id                      = (known after apply)
      + kms_key_id              = (known after apply)
      + name                    = (known after apply)
      + number_of_mount_targets = (known after apply)
      + owner_id                = (known after apply)
      + performance_mode        = "generalPurpose"
      + size_in_bytes           = (known after apply)
      + tags_all                = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "sharedservices"
        }
      + throughput_mode         = "bursting"

      + protection (known after apply)
    }

  # aws_efs_mount_target.efs_mount["subnet1"] will be created
+ resource "aws_efs_mount_target" "efs_mount" {
      + availability_zone_id   = (known after apply)
      + availability_zone_name = (known after apply)
      + dns_name               = (known after apply)
      + file_system_arn        = (known after apply)
      + file_system_id         = (known after apply)
      + id                     = (known after apply)
      + ip_address             = (known after apply)
      + mount_target_dns_name  = (known after apply)
      + network_interface_id   = (known after apply)
      + owner_id               = (known after apply)
      + security_groups        = (known after apply)
      + subnet_id              = "subnet-0bbe8a2b2335e4038"
    }

  # aws_efs_mount_target.efs_mount["subnet2"] will be created
+ resource "aws_efs_mount_target" "efs_mount" {
      + availability_zone_id   = (known after apply)
      + availability_zone_name = (known after apply)
      + dns_name               = (known after apply)
      + file_system_arn        = (known after apply)
      + file_system_id         = (known after apply)
      + id                     = (known after apply)
      + ip_address             = (known after apply)
      + mount_target_dns_name  = (known after apply)
      + network_interface_id   = (known after apply)
      + owner_id               = (known after apply)
      + security_groups        = (known after apply)
      + subnet_id              = "subnet-0b4e467b5cedc1cd3"
    }

  # aws_iam_policy.s3_full_policy will be created
+ resource "aws_iam_policy" "s3_full_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Policy to allow Lambda full access to S3"
      + id               = (known after apply)
      + name             = "sharedservices_s3_full_policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "s3:*"
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::prod-sharedservices-media-bucket",
                          + "arn:aws:s3:::prod-sharedservices-media-bucket/*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "sharedservices"
        }
    }

  # aws_iam_role.apigw_stepfunctions_role will be destroyed
  # (because aws_iam_role.apigw_stepfunctions_role is not in configuration)
- resource "aws_iam_role" "apigw_stepfunctions_role" {
      - arn                   = "arn:aws:iam::825765422855:role/APIGW-StepFunctions-CrossAccountRole" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "apigateway.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2025-03-18T23:21:28Z" -> null
      - force_detach_policies = false -> null
      - id                    = "APIGW-StepFunctions-CrossAccountRole" -> null
      - managed_policy_arns   = [] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "APIGW-StepFunctions-CrossAccountRole" -> null
      - path                  = "/" -> null
      - tags                  = {
          - "Name" = "API-Gateway-to-StepFunctions-Role"
        } -> null
      - tags_all              = {
          - "DeployedBy"  = "Terraform"
          - "Environment" = "prod"
          - "Name"        = "API-Gateway-to-StepFunctions-Role"
          - "Project"     = "sharedservices"
        } -> null
      - unique_id             = "AROA4AQ3UM4D6EPTP4MEH" -> null
        # (3 unchanged attributes hidden)

      - inline_policy {
          - name   = "AllowStartExecutionInMultipleAccounts" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = "states:StartExecution"
                          - Effect   = "Allow"
                          - Resource = [
                              - "arn:aws:states:us-east-2:390402544450:stateMachine:manual_wrestleutopia_workflow",
                            ]
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
    }

  # aws_iam_role.external_lambda_role will be destroyed
  # (because aws_iam_role.external_lambda_role is not in configuration)
- resource "aws_iam_role" "external_lambda_role" {
      - arn                   = "arn:aws:iam::825765422855:role/ExternalLambdaRole" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2025-03-19T16:12:16Z" -> null
      - force_detach_policies = false -> null
      - id                    = "ExternalLambdaRole" -> null
      - managed_policy_arns   = [] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "ExternalLambdaRole" -> null
      - path                  = "/" -> null
      - tags                  = {} -> null
      - tags_all              = {
          - "DeployedBy"  = "Terraform"
          - "Environment" = "prod"
          - "Project"     = "sharedservices"
        } -> null
      - unique_id             = "AROA4AQ3UM4DTET6TCHHG" -> null
        # (3 unchanged attributes hidden)

      - inline_policy {
          - name   = "AllowAssumeRoleInMultipleHosts" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = "sts:AssumeRole"
                          - Effect   = "Allow"
                          - Resource = "arn:aws:iam::390402544450:role/CrossAccountStartExecutionRole"
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
    }

  # aws_iam_role.step_functions_role will be created
+ resource "aws_iam_role" "step_functions_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "states.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "sharedservices_step_functions_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "sharedservices"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role_policy.allow_start_exec_remote will be destroyed
  # (because aws_iam_role_policy.allow_start_exec_remote is not in configuration)
- resource "aws_iam_role_policy" "allow_start_exec_remote" {
      - id          = "sharedservices_lambda_role:AllowStartExecRemote" -> null
      - name        = "AllowStartExecRemote" -> null
      - policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "states:StartExecution"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:states:us-east-2:390402544450:stateMachine:manual_wrestleutopia_workflow",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - role        = "sharedservices_lambda_role" -> null
        # (1 unchanged attribute hidden)
    }

  # aws_iam_role_policy.apigw_stepfunctions_policy will be destroyed
  # (because aws_iam_role_policy.apigw_stepfunctions_policy is not in configuration)
- resource "aws_iam_role_policy" "apigw_stepfunctions_policy" {
      - id          = "APIGW-StepFunctions-CrossAccountRole:AllowStartExecutionInMultipleAccounts" -> null
      - name        = "AllowStartExecutionInMultipleAccounts" -> null
      - policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "states:StartExecution"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:states:us-east-2:390402544450:stateMachine:manual_wrestleutopia_workflow",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - role        = "APIGW-StepFunctions-CrossAccountRole" -> null
        # (1 unchanged attribute hidden)
    }

  # aws_iam_role_policy.external_lambda_policy will be destroyed
  # (because aws_iam_role_policy.external_lambda_policy is not in configuration)
- resource "aws_iam_role_policy" "external_lambda_policy" {
      - id          = "ExternalLambdaRole:AllowAssumeRoleInMultipleHosts" -> null
      - name        = "AllowAssumeRoleInMultipleHosts" -> null
      - policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "sts:AssumeRole"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:iam::390402544450:role/CrossAccountStartExecutionRole"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - role        = "ExternalLambdaRole" -> null
        # (1 unchanged attribute hidden)
    }

  # aws_iam_role_policy.step_functions_policy will be created
+ resource "aws_iam_role_policy" "step_functions_policy" {
      + id          = (known after apply)
      + name        = "sharedservices_step_functions_policy"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = (known after apply)
    }

  # aws_iam_role_policy_attachment.lambda_insights_policy will be created
+ resource "aws_iam_role_policy_attachment" "lambda_insights_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/CloudWatchLambdaInsightsExecutionRolePolicy"
      + role       = "sharedservices_lambda_role"
    }

  # aws_iam_role_policy_attachment.lambda_s3_full_access will be created
+ resource "aws_iam_role_policy_attachment" "lambda_s3_full_access" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "sharedservices_lambda_role"
    }

  # aws_iam_role_policy_attachment.lambda_vpc_access will be destroyed
  # (because aws_iam_role_policy_attachment.lambda_vpc_access is not in configuration)
- resource "aws_iam_role_policy_attachment" "lambda_vpc_access" {
      - id         = "sharedservices_lambda_role-20250318232128754600000001" -> null
      - policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaVPCAccessExecutionRole" -> null
      - role       = "sharedservices_lambda_role" -> null
    }

  # aws_iam_role_policy_attachment.lambda_xray_write_access will be created
+ resource "aws_iam_role_policy_attachment" "lambda_xray_write_access" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AWSXRayDaemonWriteAccess"
      + role       = "sharedservices_lambda_role"
    }

  # aws_lambda_function.api_router will be destroyed
  # (because aws_lambda_function.api_router is not in configuration)
- resource "aws_lambda_function" "api_router" {
      - architectures                  = [
          - "x86_64",
        ] -> null
      - arn                            = "arn:aws:lambda:us-east-2:825765422855:function:api-router" -> null
      - code_sha256                    = "yij6IK/OcAgvtfIu3yBm68MWdwk3/X1jJCyr6nJWhdI=" -> null
      - filename                       = "./artifacts/scripts/api_router/api_router.zip" -> null
      - function_name                  = "api-router" -> null
      - handler                        = "lambda_function.lambda_handler" -> null
      - id                             = "api-router" -> null
      - invoke_arn                     = "arn:aws:apigateway:us-east-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-2:825765422855:function:api-router/invocations" -> null
      - last_modified                  = "2025-03-19T17:36:29.000+0000" -> null
      - layers                         = [] -> null
      - memory_size                    = 128 -> null
      - package_type                   = "Zip" -> null
      - publish                        = false -> null
      - qualified_arn                  = "arn:aws:lambda:us-east-2:825765422855:function:api-router:$LATEST" -> null
      - qualified_invoke_arn           = "arn:aws:apigateway:us-east-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-2:825765422855:function:api-router:$LATEST/invocations" -> null
      - reserved_concurrent_executions = -1 -> null
      - role                           = "arn:aws:iam::825765422855:role/sharedservices_lambda_role" -> null
      - runtime                        = "python3.9" -> null
      - skip_destroy                   = false -> null
      - source_code_hash               = "yij6IK/OcAgvtfIu3yBm68MWdwk3/X1jJCyr6nJWhdI=" -> null
      - source_code_size               = 853 -> null
      - tags                           = {} -> null
      - tags_all                       = {
          - "DeployedBy"  = "Terraform"
          - "Environment" = "prod"
          - "Project"     = "sharedservices"
        } -> null
      - timeout                        = 3 -> null
      - version                        = "$LATEST" -> null
        # (6 unchanged attributes hidden)

      - environment {
          - variables = {
              - "STEPFUNCTIONS_ARNS_JSON" = jsonencode(
                    {
                      - wrestleutopia = "arn:aws:states:us-east-2:390402544450:stateMachine:manual_wrestleutopia_workflow"
                    }
                )
            } -> null
        }

      - ephemeral_storage {
          - size = 512 -> null
        }

      - logging_config {
          - log_format            = "Text" -> null
          - log_group             = "/aws/lambda/api-router" -> null
            # (2 unchanged attributes hidden)
        }

      - tracing_config {
          - mode = "PassThrough" -> null
        }
    }

  # aws_lambda_function.crossaccounts_invoker will be destroyed
  # (because aws_lambda_function.crossaccounts_invoker is not in configuration)
- resource "aws_lambda_function" "crossaccounts_invoker" {
      - architectures                  = [
          - "x86_64",
        ] -> null
      - arn                            = "arn:aws:lambda:us-east-2:825765422855:function:crossaccount_invoker" -> null
      - code_sha256                    = "+o7QR28iO7amyfYfSyhF4Z8gkbZBavXZ2ptrCTQml/w=" -> null
      - filename                       = "./artifacts/scripts/crossaccount_invoker/crossaccount_invoker.zip" -> null
      - function_name                  = "crossaccount_invoker" -> null
      - handler                        = "lambda_function.lambda_handler" -> null
      - id                             = "crossaccount_invoker" -> null
      - invoke_arn                     = "arn:aws:apigateway:us-east-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-2:825765422855:function:crossaccount_invoker/invocations" -> null
      - last_modified                  = "2025-03-19T17:28:07.000+0000" -> null
      - layers                         = [] -> null
      - memory_size                    = 128 -> null
      - package_type                   = "Zip" -> null
      - publish                        = false -> null
      - qualified_arn                  = "arn:aws:lambda:us-east-2:825765422855:function:crossaccount_invoker:$LATEST" -> null
      - qualified_invoke_arn           = "arn:aws:apigateway:us-east-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-2:825765422855:function:crossaccount_invoker:$LATEST/invocations" -> null
      - reserved_concurrent_executions = -1 -> null
      - role                           = "arn:aws:iam::825765422855:role/ExternalLambdaRole" -> null
      - runtime                        = "python3.9" -> null
      - skip_destroy                   = false -> null
      - source_code_hash               = "+o7QR28iO7amyfYfSyhF4Z8gkbZBavXZ2ptrCTQml/w=" -> null
      - source_code_size               = 891 -> null
      - tags                           = {} -> null
      - tags_all                       = {
          - "DeployedBy"  = "Terraform"
          - "Environment" = "prod"
          - "Project"     = "sharedservices"
        } -> null
      - timeout                        = 3 -> null
      - version                        = "$LATEST" -> null
        # (6 unchanged attributes hidden)

      - environment {
          - variables = {
              - "CROSS_ACCT_ROLES" = jsonencode(
                    [
                      - "arn:aws:iam::390402544450:role/CrossAccountStartExecutionRole",
                    ]
                )
            } -> null
        }

      - ephemeral_storage {
          - size = 512 -> null
        }

      - logging_config {
          - log_format            = "Text" -> null
          - log_group             = "/aws/lambda/crossaccount_invoker" -> null
            # (2 unchanged attributes hidden)
        }

      - tracing_config {
          - mode = "PassThrough" -> null
        }
    }

  # aws_lambda_function.delete_logo will be created
+ resource "aws_lambda_function" "delete_logo" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "./artifacts/scripts/delete_logo/delete_logo.zip"
      + function_name                  = "delete_logo"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::825765422855:role/sharedservices_lambda_role"
      + runtime                        = "python3.9"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "iTmuGIwFx5YfX7xW746uDLGw0ZkooVAA89bGJG2ZtTU="
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "sharedservices"
        }
      + timeout                        = 10
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "ACCOUNT_MAP"                 = jsonencode(
                    {
                      + animeutopia   = "481665084477"
                      + wrestleutopia = "390402544450"
                    }
                )
              + "CROSSACCOUNT_READ_ROLE_NAME" = "CrossAccountS3ReadRole"
              + "TARGET_BUCKET"               = "prod-sharedservices-artifacts-bucket"
            }
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # aws_lambda_function.get_logo will be created
+ resource "aws_lambda_function" "get_logo" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "./artifacts/scripts/get_logo/get_logo.zip"
      + function_name                  = "get_logo"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::825765422855:role/sharedservices_lambda_role"
      + runtime                        = "python3.9"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "Ua2EjinydPfFU+LPbbunxLjuZXWJV5Cn7D8Tqzrc+NQ="
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "sharedservices"
        }
      + timeout                        = 10
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "ACCOUNT_MAP"                 = jsonencode(
                    {
                      + animeutopia   = "481665084477"
                      + wrestleutopia = "390402544450"
                    }
                )
              + "CROSSACCOUNT_READ_ROLE_NAME" = "CrossAccountS3ReadRole"
              + "TARGET_BUCKET"               = "prod-sharedservices-artifacts-bucket"
            }
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # aws_lambda_function.notify_post will be created
+ resource "aws_lambda_function" "notify_post" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "./artifacts/scripts/notify_post/notify_post.zip"
      + function_name                  = "notify_post"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = [
          + "arn:aws:lambda:us-east-2:825765422855:layer:Python_Requests:1",
          + "arn:aws:lambda:us-east-2:580247275435:layer:LambdaInsightsExtension:14",
        ]
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::825765422855:role/sharedservices_lambda_role"
      + runtime                        = "python3.9"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "WcnSdEzALE3Cuvl7OhAVNer9j4hpLwrHQp0bnnqqoEk="
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "sharedservices"
        }
      + timeout                        = 10
      + version                        = (known after apply)

      + dead_letter_config {
          + target_arn = (known after apply)
        }

      + environment {
          + variables = {
              + "TARGET_BUCKET"       = "prod-sharedservices-media-bucket"
              + "TEAMS_WEBHOOKS_JSON" = jsonencode(
                    {
                      + animeutopia   = {
                          + auto   = "https://feedutopia.webhook.office.com/webhookb2/0ec044b6-d4fe-42b4-98f4-ca8a9b2e491e@c76f234b-5cdf-49b5-b968-9d0517a5c694/IncomingWebhook/15df2c60c45142c7ba181f8f344e4998/2742a55c-9d93-47f0-aed1-1965283926c0/V2Cnzgq7uVfRrUuBqjjg-PFkjf5_B3LNar_rdf3HmjIWk1"
                          + manual = "https://feedutopia.webhook.office.com/webhookb2/0ec044b6-d4fe-42b4-98f4-ca8a9b2e491e@c76f234b-5cdf-49b5-b968-9d0517a5c694/IncomingWebhook/782c0a472f0d49efba1a273ce2be2e99/2742a55c-9d93-47f0-aed1-1965283926c0/V2_ir389v5GI9tjXmVusULmYu9oQgKBzvwbXJ7TzK91so1"
                        }
                      + wrestleutopia = {
                          + auto   = "https://feedutopia.webhook.office.com/webhookb2/4d9dfc6f-4e46-45e9-842b-b9bb0343b83d@c76f234b-5cdf-49b5-b968-9d0517a5c694/IncomingWebhook/a40586b415b64e8fb9c188fc82a23559/2742a55c-9d93-47f0-aed1-1965283926c0/V2UwbSe1Rj0AKXMVwKk7dmo11nGQUrDxaAiN-DkdQVo5U1"
                          + manual = "https://feedutopia.webhook.office.com/webhookb2/4d9dfc6f-4e46-45e9-842b-b9bb0343b83d@c76f234b-5cdf-49b5-b968-9d0517a5c694/IncomingWebhook/370f96cc967740bfb6693ce8e343caa3/2742a55c-9d93-47f0-aed1-1965283926c0/V2XfHhkWYO3wYScaUkayH4-sJr-vp_6GAHIrKChZcwMyw1"
                        }
                    }
                )
            }
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config {
          + mode = "Active"
        }
    }

  # aws_lambda_function.render_video will be created
+ resource "aws_lambda_function" "render_video" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + function_name                  = "render_video"
      + id                             = (known after apply)
      + image_uri                      = "825765422855.dkr.ecr.us-east-2.amazonaws.com/render_video_repository@sha256:525b669bb0b7639587a136e6842897bbc338b40c8f9f6cbf6983b18daa42fe45"
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 3008
      + package_type                   = "Image"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::825765422855:role/sharedservices_lambda_role"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "sharedservices"
        }
      + timeout                        = 300
      + version                        = (known after apply)

      + dead_letter_config {
          + target_arn = (known after apply)
        }

      + environment {
          + variables = {
              + "FFMPEG_PATH"   = "/opt/bin/ffmpeg"
              + "TARGET_BUCKET" = "prod-sharedservices-artifacts-bucket"
            }
        }

      + ephemeral_storage (known after apply)

      + file_system_config {
          + arn              = (known after apply)
          + local_mount_path = "/mnt/efs"
        }

      + logging_config (known after apply)

      + tracing_config {
          + mode = "Active"
        }
    }

  # aws_lambda_function.start_sfn will be created
+ resource "aws_lambda_function" "start_sfn" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "./artifacts/scripts/start_sfn/start_sfn.zip"
      + function_name                  = "start_sfn"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::825765422855:role/sharedservices_lambda_role"
      + runtime                        = "python3.9"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "ZLdA3mnqvz+hd5D0RztEX/PouhhIUGvWOe7ULhWaLmc="
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "sharedservices"
        }
      + timeout                        = 10
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # aws_lambda_permission.allow_api_gateway_invoke_api_router will be destroyed
  # (because aws_lambda_permission.allow_api_gateway_invoke_api_router is not in configuration)
- resource "aws_lambda_permission" "allow_api_gateway_invoke_api_router" {
      - action              = "lambda:InvokeFunction" -> null
      - function_name       = "api-router" -> null
      - id                  = "AllowAPIGatewayInvokeApiRouter" -> null
      - principal           = "apigateway.amazonaws.com" -> null
      - source_arn          = "arn:aws:execute-api:us-east-2:825765422855:70paytfqfb/*" -> null
      - statement_id        = "AllowAPIGatewayInvokeApiRouter" -> null
        # (2 unchanged attributes hidden)
    }

  # aws_lambda_permission.allow_eventbridge_trigger will be destroyed
  # (because aws_lambda_permission.allow_eventbridge_trigger is not in configuration)
- resource "aws_lambda_permission" "allow_eventbridge_trigger" {
      - action              = "lambda:InvokeFunction" -> null
      - function_name       = "crossaccount_invoker" -> null
      - id                  = "AllowExecutionFromEventBridge" -> null
      - principal           = "events.amazonaws.com" -> null
      - source_arn          = "arn:aws:events:us-east-2:825765422855:rule/crossaccount-invoker-schedule" -> null
      - statement_id        = "AllowExecutionFromEventBridge" -> null
        # (2 unchanged attributes hidden)
    }

  # aws_s3_bucket.media_bucket will be created
+ resource "aws_s3_bucket" "media_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "prod-sharedservices-media-bucket"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "sharedservices"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # aws_s3_bucket_lifecycle_configuration.media_bucket_lifecycle will be created
+ resource "aws_s3_bucket_lifecycle_configuration" "media_bucket_lifecycle" {
      + bucket                                 = (known after apply)
      + expected_bucket_owner                  = (known after apply)
      + id                                     = (known after apply)
      + transition_default_minimum_object_size = "all_storage_classes_128K"

      + rule {
          + id     = "delete_posts_after_1_week"
          + prefix = (known after apply)
          + status = "Enabled"

          + expiration {
              + days                         = 7
              + expired_object_delete_marker = (known after apply)
            }

          + filter {
              + object_size_greater_than = (known after apply)
              + object_size_less_than    = (known after apply)
              + prefix                   = "posts/"
            }
        }
    }

  # aws_s3_bucket_server_side_encryption_configuration.media_bucket_encryption will be created
+ resource "aws_s3_bucket_server_side_encryption_configuration" "media_bucket_encryption" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + bucket_key_enabled = true

          + apply_server_side_encryption_by_default {
              + kms_master_key_id = "alias/aws/s3"
              + sse_algorithm     = "aws:kms"
            }
        }
    }

  # aws_s3_bucket_versioning.media_bucket_versioning will be created
+ resource "aws_s3_bucket_versioning" "media_bucket_versioning" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

  # aws_security_group.efs_sg will be created
+ resource "aws_security_group" "efs_sg" {
      + arn                    = (known after apply)
      + description            = "Security group for EFS mount for Lambda"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "10.1.0.0/16",
                ]
              + from_port        = 2049
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 2049
                # (1 unchanged attribute hidden)
            },
        ]
      + name                   = "efs_lambda_sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "sharedservices"
        }
      + vpc_id                 = "vpc-03e292a15572478b7"
    }

  # aws_sfn_state_machine.manual_workflow will be created
+ resource "aws_sfn_state_machine" "manual_workflow" {
      + arn                       = (known after apply)
      + creation_date             = (known after apply)
      + definition                = (known after apply)
      + description               = (known after apply)
      + id                        = (known after apply)
      + name                      = "manual_workflow"
      + name_prefix               = (known after apply)
      + publish                   = false
      + revision_id               = (known after apply)
      + role_arn                  = (known after apply)
      + state_machine_version_arn = (known after apply)
      + status                    = (known after apply)
      + tags_all                  = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "sharedservices"
        }
      + type                      = "EXPRESS"
      + version_description       = (known after apply)

      + encryption_configuration (known after apply)

      + logging_configuration {
          + include_execution_data = true
          + level                  = "ALL"
          + log_destination        = (known after apply)
        }

      + tracing_configuration (known after apply)
    }

  # aws_sqs_queue.lambda_dlq will be created
+ resource "aws_sqs_queue" "lambda_dlq" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + max_message_size                  = 262144
      + message_retention_seconds         = 345600
      + name                              = "sharedservices-lambda-dlq"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = (known after apply)
      + sqs_managed_sse_enabled           = (known after apply)
      + tags_all                          = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "sharedservices"
        }
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 30
    }

  # aws_xray_group.production_group will be created
+ resource "aws_xray_group" "production_group" {
      + arn               = (known after apply)
      + filter_expression = "annotation.stage = \"prod\""
      + group_name        = "ProductionTraces"
      + id                = (known after apply)
      + tags_all          = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "sharedservices"
        }

      + insights_configuration (known after apply)
    }

  # aws_xray_sampling_rule.critical_service_rule will be created
+ resource "aws_xray_sampling_rule" "critical_service_rule" {
      + arn            = (known after apply)
      + fixed_rate     = 1
      + host           = "*"
      + http_method    = "*"
      + id             = (known after apply)
      + priority       = 10
      + reservoir_size = 2
      + resource_arn   = "*"
      + rule_name      = "CriticalService"
      + service_name   = "my-critical-service"
      + service_type   = "*"
      + tags_all       = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "sharedservices"
        }
      + url_path       = "*"
      + version        = 1
    }

  # aws_xray_sampling_rule.fallback_rule will be created
+ resource "aws_xray_sampling_rule" "fallback_rule" {
      + arn            = (known after apply)
      + fixed_rate     = 0.05
      + host           = "*"
      + http_method    = "*"
      + id             = (known after apply)
      + priority       = 9999
      + reservoir_size = 1
      + resource_arn   = "*"
      + rule_name      = "Fallback"
      + service_name   = "*"
      + service_type   = "*"
      + tags_all       = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "sharedservices"
        }
      + url_path       = "*"
      + version        = 1
    }

Plan: 34 to add, 1 to change, 14 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p sharedservices-prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://atlantis.feedutopia.com:4141/lock?id=ryan-longoria%252FFeedUtopia%252Faccounts%252Fsharedservices-prod%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p sharedservices-prod
  ```
Plan: 34 to add, 1 to change, 14 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```